joey9D/HardwareAPI/Project/CAN-to-CAN5/CAN-to-CAN5/Old_and_NewAbstraction/New/Hardware_Abstraction/STM32/STM32G0/STM32G0_Hardware.cpp
#include "STM32G0_Hardware.h"
#include "CANopen.h"
extern "C" 
{
    #include "CO_app_STM32.h"
}
#include "Hardware_Definitions.h"


//#define REGISTERIO

ActiveBoardPins boardPins; // The global instance for the selected board



STM32G0_Hardware* STM32G0_Hardware::s_instance = nullptr;




extern "C" void EXTI0_1_IRQHandler(void)
{

    if (!STM32G0_Hardware::s_instance) return;

    for (uint8_t pinLine = 0; pinLine <= 1; ++pinLine)

    {

        if (!STM32G0_Hardware::s_instance->extiEnabledPins[pinLine])
            continue;

        uint16_t pin = 1 << pinLine;
        if (__HAL_GPIO_EXTI_GET_IT(pin) != RESET)
        {

            HAL_GPIO_EXTI_IRQHandler(pin);

        }

    }

}

extern "C" void EXTI2_3_IRQHandler(void)
{

    if (!STM32G0_Hardware::s_instance) return;

    for (uint8_t pinLine = 2; pinLine <= 3; ++pinLine)
    {

        if (!STM32G0_Hardware::s_instance->extiEnabledPins[pinLine])
            continue;

        uint16_t pin = 1 << pinLine;
        if (__HAL_GPIO_EXTI_GET_IT(pin) != RESET)
        {

            HAL_GPIO_EXTI_IRQHandler(pin);

        }

    }

}

extern "C" void EXTI4_15_IRQHandler(void)
{

    if (!STM32G0_Hardware::s_instance) return;

    for (uint8_t pinLine = 4; pinLine <= 15; ++pinLine)

    {

        if (!STM32G0_Hardware::s_instance->extiEnabledPins[pinLine])
            continue;

        uint16_t pin = 1 << pinLine;
        if (__HAL_GPIO_EXTI_GET_IT(pin) != RESET)
        {

            HAL_GPIO_EXTI_IRQHandler(pin);

        }

    }

}





extern "C" void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim)
	{
		if(STM32G0_Hardware::s_instance)
        {
            // Call the time handler of CANopenNode
            STM32G0_Hardware::s_instance->timingHandler();
	    
        }
    }

//extern "C" void HAL_FDCAN_RxFifo0Callback(FDCAN_HandleTypeDef* hfdcan, uint32_t RxFifo0ITs)
//	{
//		if(STM32G0_Hardware::s_instance)
//        {
//             STM32G0_Hardware::s_instance->timingHandler();
//        }
//
//	}
//
extern "C" void HAL_FDCAN_RxFifo1Callback(FDCAN_HandleTypeDef* hfdcan, uint32_t RxFifo1ITs)
	{
		if (hfdcan == &hfdcan1 && (RxFifo1ITs & FDCAN_IT_RX_FIFO1_NEW_MESSAGE))
		{
	        	while (HAL_FDCAN_GetRxFifoFillLevel(hfdcan, FDCAN_RX_FIFO1) > 0)
	        	{
	        		FDCAN_RxHeaderTypeDef rxHeader;
	        		uint8_t rxData[8];
	        		if (HAL_FDCAN_GetRxMessage(hfdcan, FDCAN_RX_FIFO1, &rxHeader, rxData) == HAL_OK)
	        		{
	                // Check for CANopen bootup message: CAN-ID 0x701–0x77F, DLC=1, data[0]=0x00
	        			if ((rxHeader.Identifier & 0x780) == 0x700 &&
	        					rxHeader.DataLength == FDCAN_DLC_BYTES_1 &&
								rxData[0] == 0x00)
	        			{
	                    uint8_t nodeId = rxHeader.Identifier & 0x7F;
	                    // --- Handle bootup for nodeId here ---
	        			}
	        		}
	        	}
		}
        else 
        {
            if (RxFifo1ITs & FDCAN_IT_RX_FIFO1_NEW_MESSAGE && STM32G0_Hardware::s_instance) 
            {
            // Read all messages in FIFO1
            while (HAL_FDCAN_GetRxFifoFillLevel(hfdcan, FDCAN_RX_FIFO1) > 0) 
                {
                    FDCAN_RxHeaderTypeDef rxHeader;
                    uint8_t rxData[8];
                    if (HAL_FDCAN_GetRxMessage(hfdcan, FDCAN_RX_FIFO1, &rxHeader, rxData) == HAL_OK) 
                    {
                        // Call the registered CAN interrupt callback
                        if (STM32G0_Hardware::s_instance->m_canInterruptCallback) {
                            STM32G0_Hardware::s_instance->m_canInterruptCallback(rxData, rxHeader.Identifier);
                        }
                    }
                }
            }
        }

    }

	//Callback for CAN Error
extern "C" void HAL_FDCAN_ErrorCallback(FDCAN_HandleTypeDef *hfdcan)
	{

        if (STM32G0_Hardware::s_instance)
        {

            STM32G0_Hardware::s_instance->errorHandler();

        }
		
	}

// A static/global pointer to our hardware instance:

extern "C" void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin)
    {

        if (STM32G0_Hardware::s_instance) 
        {

            STM32G0_Hardware::s_instance->HandlePinInterrupt(GPIO_Pin);

        }

    }


// end

int STM32G0_Hardware::CANopen_Init() 

{
    // Initialize the CANopenNode with the desired settings
 
   return canopen_app_init(&canopenNodeSTM32); // Pass the appropriate parameter if needed
   
}



void STM32G0_Hardware::CANopen_Process() 
{
    // Process the CANopenNode tasks

   canopen_app_process();
   
}

uint32_t STM32G0_Hardware::CANopen_Reset() 
{
    // Reset the CANopenNode state
    return canopen_app_resetCommunication();
}
void STM32G0_Hardware::CANopen_Interrupt() 
{
    // Handle the CANopenNode interrupt
    canopen_app_interrupt();
}




bool STM32G0_Hardware::isIdValid() 
{
    if (canopenNodeSTM32.desiredNodeID!= canopenNodeSTM32.activeNodeID)
    {
        return false; // Node ID is not valid
    }

    else 
    {
        return true; // Node ID is valid
    }

}


void STM32G0_Hardware::getstate(int state)
{
    if (state ==0)
    {
         nodestate= false; // Node is not in the desired state
    }

    else
    {
        nodestate = true ; // Node is in the desired state
    }


}

void STM32G0_Hardware::MasterNodesendCommand(int command , int nodeId)
{
    // Default command is sent to all nodes (nodeId = 0)
    // Reset the master node
    CO_NMT_sendCommand(canopenNodeSTM32.canOpenStack->NMT, (CO_NMT_command_t)command, nodeId); // Send reset command to all nodes to hear bootup at correct time.
}

bool STM32G0_Hardware::getNMTinternalstate(int state)
{
    // Get NMT internal state
    if (CO_NMT_getInternalState(canopenNodeSTM32.canOpenStack->NMT) == state)
    {
        return true;
    }
    return false;
}
void STM32G0_Hardware::setNMTinternalstate(int state)
{
    // Set NMT internal state
    CO_NMT_sendInternalCommand(canopenNodeSTM32.canOpenStack->NMT, (CO_NMT_command_t)state);
}

void STM32G0_Hardware::RegisterMasterCallbacks() 
{
    // Register callbacks for master node events
    CO_HBconsumer_initCallbackNmtChanged(canopenNodeSTM32.canOpenStack->HBcons,0, this, onNodeNmtChanged);
    //CO_NMT_registerCallback(canopenNodeSTM32.canOpenStack->NMT, CO_NMT_ENTER_OPERATIONAL, onNmtStateChange, &canopenNodeSTM32);
    //CO_HBconsumer_registerCallback(canopenNodeSTM32.canOpenStack->HBcons, onHeartbeatTimeout, &canopenNodeSTM32);
}
void STM32G0_Hardware::NodeStateHandler()
{

