joey9D/HardwareAPI/Project/CAN-to-CAN5/CAN-to-CAN5/Old_and_NewAbstraction/New/Hardware_Abstraction/STM32/STM32G0/STM32G0_Hardware.cpp
    CO_HBconsumer_t* hbCons = canopenNodeSTM32.canOpenStack->HBcons; // You may need to implement this getter

    if (!hbCons)
    {
        return;
    }

    //     for (uint8_t i = 0; i < hbCons->numberOfMonitoredNodes; ++i) 
    // {
    //     CO_HBconsNode_t* node = &hbCons->monitoredNodes[i];
    //     uint8_t nodeId = node->nodeId;

    //     // Detect transition from inactive to active
    //     if (node->HBstate == CO_HBconsumer_ACTIVE && node->NMTstate == CO_NMT_PRE_OPERATIONAL) 
    //     {
    //         // Node just became active
    //         CO_NMT_sendCommand(canopenNodeSTM32.canOpenStack->NMT, CO_NMT_ENTER_OPERATIONAL, nodeId);
    //         // You may want to log this event or take other actions
    //         lastHBstate[nodeId] = node->HBstate; // Update last state
    //     }

    //     if (node->HBstate == CO_HBconsumer_ACTIVE && node->NMTstate == CO_NMT_OPERATIONAL) 
    //     {
    //         // Node is operational, update last state
    //         lastHBstate[nodeId] = node->HBstate;
    //     } 
    //     else if (node->HBstate == CO_HBconsumer_INACTIVE || node->HBstate == CO_HBconsumer_UNKNOWN) 
    //     {
    //         // Node is inactive or unknown, check if it was previously active
    //         if (lastHBstate[nodeId] == CO_HBconsumer_ACTIVE) 
    //         {
    //             // Node just became inactive or unknown
    //             // You may want to log this event or take other actions
    //             lastHBstate[nodeId] = node->HBstate; // Update last state
    //         }
    //     }
        
    // }
    // for (uint8_t i = 0; i < hbCons->numberOfMonitoredNodes; ++i) {
    //     CO_HBconsNode_t* node = &hbCons->monitoredNodes[i];
    //     uint8_t nodeId = node->nodeId;
    //     uint32_t now = HAL_GetTick();

    //     // If node booted up and is pre-operational, and not yet operational, send NMT operational ONCE
    //     if (node->HBstate == CO_HBconsumer_ACTIVE &&
    //         node->NMTstate == CO_NMT_PRE_OPERATIONAL &&
    //         nodeStatus[nodeId].bootup_received &&
    //         !nodeStatus[nodeId].operational)
    //     {
    //         if( now - nodeStatus[nodeId].lastNmtCommandTime > 1000) // Avoid spamming NMT command
    //         {
    //             CO_NMT_sendCommand(canopenNodeSTM32.canOpenStack->NMT, CO_NMT_ENTER_OPERATIONAL, nodeId);
    //             nodeStatus[nodeId].lastNmtCommandTime = now; // Update last NMT command time
    //             // Don't set operational=true here; wait for confirmation via callback
    //         }
    //     }
    // }
       for (uint8_t i = 0; i < hbCons->numberOfMonitoredNodes; ++i) {
        CO_HBconsNode_t* node = &hbCons->monitoredNodes[i];
        uint8_t nodeId = node->nodeId;
        uint32_t now = HAL_GetTick();

        // If node booted up and is pre-operational, and not yet operational, send NMT operational ONCE
        if (node->HBstate == CO_HBconsumer_ACTIVE &&
            node->NMTstate == CO_NMT_PRE_OPERATIONAL &&
            !nodeStatus[nodeId].operational)
        {
            if( now - nodeStatus[nodeId].lastNmtCommandTime > 1000) // Avoid spamming NMT command
            {
                CO_NMT_sendCommand(canopenNodeSTM32.canOpenStack->NMT, CO_NMT_ENTER_OPERATIONAL, nodeId);
                nodeStatus[nodeId].lastNmtCommandTime = now; // Update last NMT command time
                // Don't set operational=true here; wait for confirmation via callback
            }
        }
    }


}


void STM32G0_Hardware::onNodeNmtChanged(uint8_t nodeId, uint8_t idx, CO_NMT_internalState_t NMTstate, void *object)
{
    //CO_NMT_t *nmt = (CO_NMT_t *)object;

    // // Handle NMT state change
    // switch (NMTstate) 
    // {
    //     case CO_NMT_OPERATIONAL:
    //         {// Node entered operational state
    //         // You may want to log, enable outputs, etc.
    //         break;
    //         }
    //     case CO_NMT_PRE_OPERATIONAL:
    //         {// Node entered pre-operational state (e.g., after bootup)
    //         // If you want all nodes to be operational, send NMT operational command here:
    //         CO_NMT_sendCommand((CO_NMT_t*)object, CO_NMT_ENTER_OPERATIONAL, nodeId);
    //         break;
    //         }
    //     case CO_NMT_INITIALIZING:
    //         {// Node sent bootup message (CANopen bootup)
    //         // You may want to send NMT operational here as well
    //         CO_NMT_sendCommand((CO_NMT_t*)object, CO_NMT_ENTER_OPERATIONAL, nodeId);
    //         break;
    //         }
    //     case CO_NMT_UNKNOWN:
    //         {// Node is lost (timeout or not yet seen)
    //         // Handle node lost: log, alert, disable outputs, etc.
    //         CO_NMT_sendCommand((CO_NMT_t*)object, CO_NMT_ENTER_OPERATIONAL, nodeId);
    //         break;
    //         }
    //     case CO_NMT_STOPPED:
    //         {// Node entered stopped state
    //         // Optional: handle as needed
    //         break;
    //         }
    //     default:
    //         {// Other states if any
    //         break;
    //         }
    // }
    STM32G0_Hardware* hardware = static_cast<STM32G0_Hardware*>(object);
      if (nodeId >= 128) 
      {
          return;
      }

    switch (NMTstate) 
    {
        case CO_NMT_INITIALIZING:
        {
            hardware->nodeStatus[nodeId].bootup_received = true;
            hardware->nodeStatus[nodeId].operational = false;
            // Optionally send NMT operational here, or let NodeStateHandler do it
            break;
        }
        case CO_NMT_OPERATIONAL:
        {
            hardware->nodeStatus[nodeId].operational = true;
            break;
        }
        case CO_NMT_PRE_OPERATIONAL:
        {
            hardware->nodeStatus[nodeId].operational = false;
            break;
        }
        default:
        {
            hardware->nodeStatus[nodeId].operational = false;
            break;
        }
    }
}
bool STM32G0_Hardware::allNodesBooted() 
{
    for (uint8_t i = 0; i < MAX_NODES; ++i) 
    {
        if (nodeStatus[i].bootup_received && !nodeStatus[i].operational) 
        {
            return false; // At least one node is not operational
        }
    }
    return true; // All nodes are operational
}



void STM32G0_Hardware::timingHandler()
{
    if (nodestate)
    {
        canopen_app_interrupt();
    }

