joey9D/HardwareAPI/Project/CAN-to-CAN5/CAN-to-CAN5/Old_and_NewAbstraction/New/Hardware_Abstraction/STM32/STM32G0/STM32G0_Hardware.cpp
}


STM32G0_Hardware::STM32G0_Hardware() 
{
    // _shiftIO.init();
    initAllPins(); // Initialize all board pins
    for (uint8_t i = 0; i < 8; ++i) 
    {
    
        _shiftRegisterPins[i].virtualSource = VirtualPinSource::ShiftRegister;
        _shiftRegisterPins[i].virtualIndex = i;
        _shiftRegisterPins[i].debounceTime = 0; // ms
    
    }

}


void STM32G0_Hardware::Init()
{
	

    // Register global instance for EXTI callback
    s_instance = this;
}

// Clock
void STM32G0_Hardware::Clock_Init()
{
    RCC_OscInitTypeDef osc = {0};
    osc.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    osc.HSIState = RCC_HSI_ON;
    osc.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    HAL_RCC_OscConfig(&osc);

    RCC_ClkInitTypeDef clk = {0};
    clk.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK;
    clk.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
    clk.AHBCLKDivider = RCC_SYSCLK_DIV1;
    HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_0);
}

void STM32G0_Hardware::Delay(uint32_t ms)
{

    HAL_Delay(ms);

}

uint32_t STM32G0_Hardware::GetTick()

{

    return HAL_GetTick();

}

void STM32G0_Hardware::HandlePinInterrupt(uint16_t pinMask)
{

#ifdef REGISTERIO

    return; // No need to handle if not using shift register
#endif

   // Check if the pin is in the input map

	 uint8_t pinLine = __builtin_ctz(pinMask);
	    int8_t index = pinToIndexLUT[pinLine];

	    if (index >= 0 && m_pinInterruptCallback) 
        {
             m_pinInterruptCallback(index);
            //m_gpioHandler->inputEventQueue.push(index);
	    
        }
}

void STM32G0_Hardware::ConfigureEXTIInterrupt(const PinInfo& pinCfg) 
{   
    pinToIndexLUT.fill(-1); // -1 = unmapped; LUT refers to Lookup Table

    assert(pinCfg.id < boardPins.clampInputs.size());
    const Pin* pinObj = boardPins.clampInputs[pinCfg.id];

	GPIO_TypeDef* port = pinObj->port();
    uint16_t pin = pinObj->pin();
    uint8_t pinNumber = __builtin_ctz(pin);  // pin must be 1 << N (e.g., GPIO_PIN_13)
    extiEnabledPins[pinNumber] = true;

    // 1. Register EXTI line to logical index mapping
    pinToIndexLUT[pinNumber] = pinCfg.id;

    // 2. Map EXTI line to the correct GPIO port via SYSCFG
    uint8_t portCode = 0;
    if (port == GPIOA) portCode = 0;
    else if (port == GPIOB) portCode = 1;
    else if (port == GPIOC) portCode = 2;
    else if (port == GPIOD) portCode = 3;
    else if (port == GPIOF) portCode = 5;

    uint8_t extiRegIndex = pinNumber / 4;
    uint8_t extiBitShift = (pinNumber % 4) * 4;

    EXTI->EXTICR[extiRegIndex] &= ~(0xF << extiBitShift);
    EXTI->EXTICR[extiRegIndex] |= (portCode << extiBitShift);

    // 3. Clear pending flag and enable EXTI IRQ line
    __HAL_GPIO_EXTI_CLEAR_IT(pin);

    if (pinNumber <= 1)
        HAL_NVIC_EnableIRQ(EXTI0_1_IRQn);
    else if (pinNumber <= 3)
        HAL_NVIC_EnableIRQ(EXTI2_3_IRQn);
    else
        HAL_NVIC_EnableIRQ(EXTI4_15_IRQn);

    // Set priority (optional, tune as needed)
    HAL_NVIC_SetPriority(EXTI4_15_IRQn, 2, 0);

}


// GPIO
void STM32G0_Hardware::GPIO_SetMode(void* port, uint8_t pin, GPIO_Mode mode) 
{

    GPIO_InitTypeDef gpio = {0};
    gpio.Pin = 1 << pin;
    gpio.Mode = static_cast<uint32_t>(mode);
    HAL_GPIO_Init(reinterpret_cast<GPIO_TypeDef*>(port), &gpio);

}

bool STM32G0_Hardware::GPIO_Read(const PinInfo& pin) 
{   
    assert(pin.id < boardPins.clampInputs.size());

    const Pin* pininfo = boardPins.clampInputs[pin.id];
	#ifdef REGISTERIO
		if (pin.virtualSource == VirtualPinSource::ShiftRegister) 
        
        {
		
            return _shiftIO.getInputBit(pin.virtualIndex);  // Use correct index
		
        }
	#endif

    //GPIO_PinState rawState = HAL_GPIO_ReadPin(reinterpret_cast<GPIO_TypeDef*>(pin.port), pin.pin);

    // Apply inversion logic if the pin is inverted
    return pininfo->read(); // Read the pin state using the Pin class method
}



void STM32G0_Hardware::GPIO_Write(const PinInfo& pin, GPIO_State state) 
{
    assert(pin.id < boardPins.clampOutputs.size());

    #ifdef REGISTERIO
		if (pin.virtualSource == VirtualPinSource::ShiftRegister) 
        {
			_shiftIO.setOutputBit(pin.virtualIndex, state);  // Use correct index
			return;
		}
	#endif
    Pin* pininfo = boardPins.clampOutputs[pin.id];

    pininfo->write(state); // Write the pin state using the Pin class method
}

void STM32G0_Hardware::GreenLed(bool state)
{
    //    GPIO_TypeDef *GPIOx = LED_GREEN_PORT;
    //     uint16_t pin = LED_GREEN_PIN;
   
    //HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin,state == GPIO_HIGH ? GPIO_PIN_SET : GPIO_PIN_RESET);

}
void  STM32G0_Hardware::RedLed() 
{


}
void STM32G0_Hardware::setpinDirection(int clamp, bool output)
{
  //Deprecated function To be Deleted
}

bool STM32G0_Hardware::GPIOPinInput(int clamp)
{   
    // Deprecated function To be Deleted
    // uint16_t pinLow = pins.getClampPin(clamp, false);
    // GPIO_TypeDef *GPIOx = pins.getClampGPIOPort(clamp);
    // return !(HAL_GPIO_ReadPin(GPIOx, pinLow) == pins.getClampInverted(clamp, false));
}

void STM32G0_Hardware::GPIOPinOutput(int clamp, bool state)
{
    // Deprecated function To be Deleted
    // uint16_t pinHigh = pins.getClampPin(clamp, true);
    // GPIO_TypeDef *GPIOx = pins.getClampGPIOPort(clamp);
    // HAL_GPIO_WritePin(GPIOx, pinHigh, (GPIO_PinState)(!(state == pins.getClampInverted(clamp, true))));
}

PinInfo STM32G0_Hardware::returnPinInput(int clamp) 
{
    assert(clamp >= 0 && clamp < boardPins.clampInputs.size());
    PinInfo info;

    #ifdef REGISTERIO
    
        info.virtualSource = VirtualPinSource::ShiftRegister;
        info.virtualIndex = clamp;
        return info;
    
    #endif

    info.id = clamp; // Unique ID for the pin
    info.inverted = boardPins.clampInputs[clamp]->inverted();
    info.debounceTime = 300;
    return info;
}

namespace 
{
    constexpr uint8_t MaxPins = 1; // Adjust if needed
    std::array<uint32_t, MaxPins> lastChangeTime = {0};
    std::array<bool, MaxPins> lastState = {false};
}

bool STM32G0_Hardware::updateDebounce(PinInfo& pinCfg, bool newState) 
{
    
    static constexpr uint8_t RISING_ONLY = 1;

    uint32_t now = HAL_GetTick();
    bool stateChanged = false;

    if (newState) 
    {  // Rising edge detected
        if ((now - pinCfg.lastDebounceTime) >= static_cast<uint32_t>(pinCfg.debounceTime)) 
        {
            pinCfg.lastDebounceTime = now;
            stateChanged = true;  // Valid rising event
        }
        // else: too soon — debounce in effect
    }

    return stateChanged;
}

