joey9D/HardwareAPI/Project/CAN-to-CAN5/CAN-to-CAN5/Old_and_NewAbstraction/New/Hardware_Abstraction/STM32/STM32G0/STM32G0_Hardware.cpp
// For output pins:
PinInfo STM32G0_Hardware::returnPinOutput(int clamp) 
{
    assert(clamp >= 0 && clamp < boardPins.clampOutputs.size());
    PinInfo info;


    #ifdef REGISTERIO
        info.virtualSource = VirtualPinSource::ShiftRegister;
        info.virtualIndex = clamp;
        return info;
    
    #endif

    info.id = clamp; // Use clamp as the index
    info.inverted = boardPins.clampOutputs[clamp]->inverted();
    info.debounceTime = 300;
    return info;

}

void STM32G0_Hardware::toggle(void* port, uint16_t pin) // Not in use to be deleted
{
    GPIO_PinState currentState = HAL_GPIO_ReadPin(reinterpret_cast<GPIO_TypeDef*>(port), pin);
    GPIO_PinState newState = (currentState == GPIO_PIN_SET) ? GPIO_PIN_RESET : GPIO_PIN_SET;
    HAL_GPIO_WritePin(reinterpret_cast<GPIO_TypeDef*>(port), pin, newState);
}

// CAN
void STM32G0_Hardware::CAN_Init(uint8_t bus, uint32_t baudrate) 
{

}


void STM32G0_Hardware::CAN_Send(uint8_t bus, uint32_t id, uint8_t* data, uint8_t len) 
{
    // ...implementation...
}

bool STM32G0_Hardware::CAN_Receive(uint8_t bus, uint32_t& id, uint8_t* buffer, uint8_t& len) 
{
    // ...implementation...
    return false;
}

void STM32G0_Hardware::CAN_ConfigFilter(uint8_t bus, uint32_t id, uint32_t mask) 
{
    // ...implementation...
}

void STM32G0_Hardware::errorHandler() 
{
    if(canopenNodeSTM32.CANHandle->ErrorCode != HAL_FDCAN_ERROR_NONE)
		{
			switch(canopenNodeSTM32.CANHandle->ErrorCode)
			{

			case HAL_FDCAN_ERROR_TIMEOUT:
			case HAL_FDCAN_ERROR_NOT_INITIALIZED:
			case HAL_FDCAN_ERROR_NOT_READY:
			case HAL_FDCAN_ERROR_NOT_STARTED:
			case HAL_FDCAN_ERROR_NOT_SUPPORTED:
			case HAL_FDCAN_ERROR_PARAM:
			case HAL_FDCAN_ERROR_PENDING:
			case HAL_FDCAN_ERROR_RAM_ACCESS:
			case HAL_FDCAN_ERROR_FIFO_EMPTY:
			case HAL_FDCAN_ERROR_FIFO_FULL:
			case HAL_FDCAN_ERROR_LOG_OVERFLOW:
			case HAL_FDCAN_ERROR_RAM_WDG:
			case HAL_FDCAN_ERROR_PROTOCOL_ARBT:
			case HAL_FDCAN_ERROR_PROTOCOL_DATA:
			case HAL_FDCAN_ERROR_RESERVED_AREA:
			default:
				break;
			
            }

			//todo
			//canopen_app_resetCommunication();
		}
}

void STM32G0_Hardware::setHandles(int nodeId) 
{
    // Set hardware handles for CANopenNode
    const HardwareHandles* handles  = hwDefs.GetHardwareHandles();
    assert(handles != nullptr);
    //assert(canopenNodeSTM32 != nullptr);
    
    canopenNodeSTM32.CANHandle = handles->can; // Assuming hcan1 is defined elsewhere
    canopenNodeSTM32.timerHandle = handles->timer; // Assuming htim3 is defined elsewhere
    canopenNodeSTM32.HWInitFunction = handles->canInitFunc; // Assuming MX_CAN_Init is defined elsewhere
    canopenNodeSTM32.desiredNodeID = nodeId;
	canopenNodeSTM32.activeNodeID = 0;
	canopenNodeSTM32.baudrate = 250;
	canopenNodeSTM32.timerCall_in_us = DEFAULT_CAN_TIMERIRQ_IN_US;
	canopenNodeSTM32.outStatusLEDGreen = 0;
	canopenNodeSTM32.outStatusLEDRed = 0;
	canopenNodeSTM32.canOpenStack = nullptr;
    assert(canopenNodeSTM32.CANHandle != nullptr);
    assert(canopenNodeSTM32.timerHandle != nullptr);
    assert(canopenNodeSTM32.HWInitFunction != nullptr);


}

// TFT/Display
void STM32G0_Hardware::TFT_Init(uint16_t width, uint16_t height) 
{
    // ...implementation...
}

void STM32G0_Hardware::TFT_DrawPixel(uint16_t x, uint16_t y, uint16_t color) 
{
    // ...implementation...
}

void STM32G0_Hardware::TFT_FillScreen(uint16_t color) 
{
    // ...implementation...
}

bool STM32G0_Hardware::TFT_TouchGetXY(uint16_t& x, uint16_t& y) 
{
    // ...implementation...
    return false;
}

// ADC
void STM32G0_Hardware::ADC_Start(uint8_t channel) 
{
//    hadc.Instance = ADC1;
//    hadc.Init.Resolution = ADC_RESOLUTION_12B;
//    HAL_ADC_Init(&hadc);
//    HAL_ADC_Start(&hadc);
}

uint16_t STM32G0_Hardware::ADC_Read(uint8_t channel) 
{
//    return HAL_ADC_GetValue(&hadc);
    return 0;
}

// PWM
void STM32G0_Hardware::PWM_Set(uint8_t timer, uint8_t channel, uint16_t value) 
{
    // ...implementation...
}

// Multi-core
void STM32G0_Hardware::M4_Core_Start(void (*func)(void)) 
{
    // ...implementation...
}

void STM32G0_Hardware::A7_Core_Init() 
{
    // ...implementation...
}

// Timer
void STM32G0_Hardware::Timer_Base_Start_IT(void* htim) 
{
    HAL_TIM_Base_Start_IT(reinterpret_cast<TIM_HandleTypeDef*>(htim));
}

// NVIC
void STM32G0_Hardware::System_Reset() 
{
    HAL_NVIC_SystemReset();
}

// Wireless (WB/WL)
#ifdef ENABLE_WIRELESS
void STM32G0_Hardware::BLE_Init() 
{
    // ...implementation...
}

void STM32G0_Hardware::LoRa_Send(uint8_t* data, uint8_t len) 
{
    // ...implementation...
}
#endif

// void STM32G0_Hardware::pollShiftRegisterInputs() {
//      #ifdef REGISTERIO
//          uint8_t current = _shiftIO.readInputs();

//          for (uint8_t i = 0; i < 8; ++i) {
//              bool currentBit = (current >> i) & 0x01;
//              bool previousBit = (_lastShiftInputState >> i) & 0x01;
//              if (currentBit != previousBit) {
//                  m_gpioHandler->inputEventQueue.push(i-1);
//              }
//          }
//          _lastShiftInputState = current;
//      #endif
//     }

int  STM32G0_Hardware::initandSetFilters(const std::array<uint32_t,13>& arr)  ///< Register CAN ID filters
{
    int err = 0;
    // Initialize FDCAN1
    hwDefs.MX_FDCAN2_Init(250);
    // Register the FDCAN2 filters
    if (Register_FDCAN_ExtendedID_Filters(&hfdcan2, arr,  1) != HAL_OK) // 1 = RXFIFO1OK;
    {
        err = -1;
        return err; // Error in filter registration
    }
    if (HAL_FDCAN_ActivateNotification(&hfdcan2, FDCAN_IT_RX_FIFO1_NEW_MESSAGE, 0) != HAL_OK) // Enable RX FIFO 1 notification
    {
        err = -1;
        return err; // Error in activating notification
    }

    // Start FDCAN2
    if (HAL_FDCAN_Start(&hfdcan2) != HAL_OK) 
    {
        err = -1;
        return err; // Error in starting FDCAN
    }

    return err; // Success
    
}


void STM32G0_Hardware::CANerrorHandler() 
{
    if(hfdcan2.ErrorCode != HAL_FDCAN_ERROR_NONE)
		{
			switch(hfdcan2.ErrorCode)
			{

			case HAL_FDCAN_ERROR_TIMEOUT:
			case HAL_FDCAN_ERROR_NOT_INITIALIZED:
			case HAL_FDCAN_ERROR_NOT_READY:
			case HAL_FDCAN_ERROR_NOT_STARTED:
			case HAL_FDCAN_ERROR_NOT_SUPPORTED:
			case HAL_FDCAN_ERROR_PARAM:
			case HAL_FDCAN_ERROR_PENDING:
			case HAL_FDCAN_ERROR_RAM_ACCESS:
			case HAL_FDCAN_ERROR_FIFO_EMPTY:
			case HAL_FDCAN_ERROR_FIFO_FULL:
			case HAL_FDCAN_ERROR_LOG_OVERFLOW:
			case HAL_FDCAN_ERROR_RAM_WDG:
			case HAL_FDCAN_ERROR_PROTOCOL_ARBT:
			case HAL_FDCAN_ERROR_PROTOCOL_DATA:
			case HAL_FDCAN_ERROR_RESERVED_AREA:
			default:
				break;
			
