joey9D/HardwareAPI/Project/CAN-to-CAN5/CAN-to-CAN5/Old_and_NewAbstraction/New/Hardware_Abstraction/STM32/STM32G0/STM32G0_Hardware.cpp
            }
            // Simple error handling: stop and restart the FDCAN2 interface
            // HAL_FDCAN_Stop(&hfdcan2);
            // HAL_FDCAN_Start(&hfdcan2);

		}
}

void STM32G0_Hardware::RegisterCANInterruptCallback(CANInterruptCallback cb) 
{
    m_canInterruptCallback = cb;
}

void STM32G0_Hardware::pollShiftRegisterInputs() 
{
    #ifdef REGISTERIO
        uint8_t current = _shiftIO.readInputs();
//    	static bool toggle = false;
//    	uint8_t current = toggle ? (1 << 2) : 0x00;
//    	toggle = !toggle;
        for (uint8_t i = 0; i < 8; ++i) 
        {
            bool currentBit = (current >> i) & 0x01;
            bool previousBit = (_lastShiftInputState >> i) & 0x01;
    
            if (currentBit != previousBit) 
            {
                if (updateDebounce(_shiftRegisterPins[i], currentBit)) 
                {
                    //m_gpioHandler->onShiftRegisterInputChange(i-1, currentBit);
                    if (m_pinInterruptCallback) m_pinInterruptCallback(i);

                }
            }
        }
        _lastShiftInputState = current;
    #endif
}


void STM32G0_Hardware::LEDblink(bool state) 
{
        //HAL_GPIO_WritePin(LED_GREEN_PORT ,LED_GREEN_PIN, state ? GPIO_PIN_SET : GPIO_PIN_RESET);
        //allPins[0]->write(state); // Use the GreenLed function to control the LED state
        boardPins.GreenLED.write(state);
}

void STM32G0_Hardware::initAllPins() 
{
    for (auto pin : boardPins.allPins) pin->init();
}

// Project Specific Functions
template <size_t N>
HAL_StatusTypeDef STM32G0_Hardware::Register_FDCAN_ExtendedID_Filters(FDCAN_HandleTypeDef *hfdcan,
                                                    const std::array<uint32_t, N>& ext_ids,
                                                    uint32_t fifo_num)
{
   for (uint32_t i = 0; i < ext_ids.size(); i += 2) {
       FDCAN_FilterTypeDef sFilterConfig = {0};
       sFilterConfig.IdType = FDCAN_EXTENDED_ID;
       sFilterConfig.FilterIndex = i / 2;
       sFilterConfig.FilterType = FDCAN_FILTER_DUAL;
       sFilterConfig.FilterConfig = (fifo_num == 1) ? FDCAN_FILTER_TO_RXFIFO1 : FDCAN_FILTER_TO_RXFIFO0;
       sFilterConfig.FilterID1 = ext_ids[i];
       sFilterConfig.FilterID2 = (i+1 < ext_ids.size()) ? ext_ids[i+1] : 0;

       HAL_StatusTypeDef ret = HAL_FDCAN_ConfigFilter(hfdcan, &sFilterConfig);
       if (ret != HAL_OK) {
           // Optional: print which ID failed, or handle error
           return ret;
       }
   }
   return HAL_OK;
}
